var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "宋慧清",
    sex: "女",
    age: "21",
    phone: "18053037747",
    email: "2047958550@qq.com",
    address: "现居山东省济南市",
    qq: "2047958550",
    excpect_work: "后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好，我是宋慧清，齐鲁工业大学物联网工程大二在读生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫宋慧清，性别女，齐鲁工业大学物联网工程大二在读生。</p>" ,



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["C++", 30, "red"],
        ["SQL", 40, "#1abc9c"],
        ["HTML5", 40, "rgba(0,0,0)"],
        ["CSS3", 30, "yellow"],
        ["JavaScript", 30, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>熟练掌握Java、C++基础。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "https://gitee.com/song-huiqing", "个人博客", "这里记录了我的C、C++学习笔记<br>持续更新"],
        ["./images/pro-2.png", "https://gitee.com/song-huiqing/c-language-learning/tree/master/C%E8%AF%AD%E8%A8%80%E5%B0%8F%E6%B8%B8%E6%88%8F%E7%BB%83%E4%B9%A0/%E4%B8%89%E5%AD%90%E6%A3%8B%E5%B0%8F%E6%B8%B8%E6%88%8F%E7%AE%80%E6%98%93%E7%89%88", "三子棋简易版", "采用C语言编写的简易三子棋小游戏"],
        ["./images/pro-3.png", "https://gitee.com/song-huiqing/c-language-learning/tree/master/C%E8%AF%AD%E8%A8%80%E5%B0%8F%E6%B8%B8%E6%88%8F%E7%BB%83%E4%B9%A0/%E6%89%AB%E9%9B%B7%E5%B0%8F%E6%B8%B8%E6%88%8F%E7%AE%80%E6%98%93%E7%89%88", "扫雷小游戏", "C语言实现的扫雷小游戏"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        ["————————", "", "<p>暂无工作经历。</p>"]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2023-09-30", "国家励志奖学金", "大二上学期，通过选拔，获得国家励志奖学金。"],
        ["2024-04-29", "第十五届蓝桥杯软件赛大学B组省二等奖", "大二下学期，我参与第十五届蓝桥杯软件赛大学B组，取得省级二等奖。"],
    ],




    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}
